Repository: GoldenPotato137/PotatoVN
Catalog: GalgameManager/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# AccountPage_Pvn_SetAccount_Button.Content
source: Edit
ja_jp: 編集
zh_cn: 编辑

# PvnSetAccountDialog_UserDisplayName.Text
source: Nickname
ja_jp: ニックネーム
zh_cn: 昵称

# PvnSetAccountDialog_Placeholder.PlaceholderText
source: Enter a new value to change; leave blank to keep current.
ja_jp: 新しい値を入力して変更、空欄の場合は変更なし
zh_cn: 填入新值来更改，留空则不变

# PvnSetAccountDialog_SetImgButton.Content
source: Select
ja_jp: 選択
zh_cn: 选择

# PvnSetAccountDialog_Avatar.Text
source: Avatar
ja_jp: アバター
zh_cn: 头像

# PvnServiceStatus_UploadingAvatar
source: Uploading avatar...
ja_jp: アバターをアップロード中...
zh_cn: 上传头像中...

# PvnServiceStatus_UploadingUserInfo
source: Updating user information...
ja_jp: ユーザー情報を更新中...
zh_cn: 更新用户信息中...

# AccountPage_Pvn_Modified
source: User information updated successfully!
ja_jp: ユーザー情報の更新に成功しました！
zh_cn: 更新用户信息成功！

# PvnServiceStatus_DownloadingAvatar
source: Downloading PotatoVN user avatar
ja_jp: PotatoVNユーザーアバターをダウンロード中
zh_cn: 下载PotatoVN用户头像中

# Shell_Info.Content
source: Status
ja_jp: ステータス
zh_cn: 状态

# Shell_InfoText.Text
source: Status
ja_jp: ステータス
zh_cn: 状态

# InfoPage_BgTask.SettingTitle
source: Background Tasks
ja_jp: バックグラウンドタスク
zh_cn: 后台任务

# InfoPage_BgTask.SettingDescription
source: These tasks will continue to run after minimizing to the system tray.
ja_jp: これらのタスクはシステムトレイに最小化された後も実行を継続します
zh_cn: 这些任务会在最小化到系统托盘后继续运行

# InfoPage_Info.SettingTitle
source: Operation Messages
ja_jp: 実行メッセージ
zh_cn: 运行消息

# InfoPage_Info.SettingDescription
source: Displays all program operation messages here, such as errors, reports, etc.
ja_jp: エラーやレポートなど、すべてのプログラム実行メッセージがここに表示されます
zh_cn: 在这里显示所有的程序运行消息，如报错、报告等

# InfoPage_NoBgTask.Text
source: No background tasks.
ja_jp: バックグラウンドタスクはまだありません
zh_cn: 暂无后台任务

# InfoPage_NoInfo.Text
source: No operation messages.
ja_jp: 実行中のメッセージはまだありません
zh_cn: 暂无运行消息

# GetGalgameInFolderTask_Title
source: Scan Folder Task: {0}
ja_jp: フォルダー{0}のスキャンタスク
zh_cn: 扫描文件夹任务：{0}

# RecordPlayTimeTask_Title
source: Record Play Time Task
ja_jp: ゲームプレイ時間記録タスク
zh_cn: 记录游戏时长任务

# UnpackGameTask_Title
source: Unpack Game Task
ja_jp: ゲームの解凍タスク
zh_cn: 解压游戏任务

# RecordPlayTimeTask_ProgressMsg
source: Recording play time: {0}
ja_jp: プレイ時間を記録中: {0}
zh_cn: 正在记录游玩时间：{0}

# SettingsPage_Other_DevelopmentMode_Description.Text
source: Enable Developer Mode?
ja_jp: 開発者モードを有効にしますか？
zh_cn: 是否开启开发者模式

# SettingsPage_Other_DevelopmentMode.Content
source: Developer Mode
ja_jp: 開発者モード
zh_cn: 开发者模式

# PvnSyncTask_Title
source: PotatoVN Sync Task
ja_jp: PotatoVN同期タスク
zh_cn: PotatoVN同步任务

# PvnSyncTask_Error
source: Pvn Sync Failed
ja_jp: Pvn同期失敗
zh_cn: Pvn同步失败

# PvnSyncTask_GettingModifiedTimestamp
source: Querying Pvn server for changes
ja_jp: Pvnサーバーの変更を照会中
zh_cn: 正在查询Pvn服务器修改

# PvnSyncTask_GettingModifiedList
source: Getting list of changes
ja_jp: 変更リストを取得中
zh_cn: 获取更改列表中

# PvnSyncTask_Downloading
source: Updating information for game {0} (ID:{1})
ja_jp: ゲーム{0}(ID:{1})の情報を更新中
zh_cn: 正在更新游戏{0}(ID:{1})的信息

# PvnSyncTask_Uploading
source: Uploading game: {0}
ja_jp: ゲームをアップロード中:{0}
zh_cn: 正在上传游戏:{0}

# PvnSyncTask_Error_Upload
source: Pvn Sync (Upload) Failed
ja_jp: Pvn同期(アップロード)失敗
zh_cn: Pvn同步(上传)失败

# PvnSyncTask_Completed
source: PotatoVN Sync Completed
ja_jp: PotaotVN同期完了
zh_cn: PotaotVN同步完成

# PvnSyncTask_Error_NotLogin
source: Not logged in
ja_jp: 未ログイン
zh_cn: 未登录

# PvnSyncTask_Error_Network
source: Unable to connect to server
ja_jp: サーバーに接続できません
zh_cn: 无法连接至服务器

# BgmOAuthService_RefreshFailed
source: Bangumi Token refresh failed
ja_jp: Bangumiトークンの更新に失敗しました
zh_cn: 更新Bangumi Token失败

# PvnSyncTask_Error_Upload_SaveSyncTime
source: Failed to save Pvn sync modification time
ja_jp: Pvn同期で変更時間の保存に失敗しました
zh_cn: Pvn同步保存修改时间失败

# PvnSyncTask_Pull_Added
source: Downloaded from remote: {0} (id:{1})
ja_jp: リモートからダウンロード中：{0} (id:{1})
zh_cn: 从远端下载：{0} (id:{1})

# PvnSyncTask_Pull_Updated
source: Updated from remote: {0} (id:{1})
ja_jp: リモートから更新中：{0} (id:{1})
zh_cn: 从远端更新：{0} (id:{1})

# PvnSyncTask_Pull_Deleted
source: Deleted from remote: {0} (id:{1})
ja_jp: リモートと共に削除：{0} (id:{1})
zh_cn: 随远端删除：{0} (id:{1})

# PvnSyncTask_Commit
source: Uploading game: {0} (id:{1}) / Type:{2}
ja_jp: ゲームをアップロード: {0} (id:{1}) / タイプ:{2}
zh_cn: 上传游戏: {0} (id:{1}) / Type:{2}

# PvnSyncTask_NoChange
source: Synchronized to latest state, no changes
ja_jp: 最新の状態に同期済み、変更なし
zh_cn: 已同步至最新状态，无更改

# ShellPage_Info_Event
source: Details
ja_jp: 詳細
zh_cn: 详情

# SettingsPage_Notification_Pvn.Title
source: Pvn Synchronization Event Notification
ja_jp: Pvn同期イベント通知
zh_cn: Pvn同步事件通知

# SettingsPage_Notification_Pvn.Description
source: Enable Pvn synchronization event notifications (e.g., sync complete/sync failed)
ja_jp: Pvn同期イベント(同期完了/同期失敗など)の通知を有効にしますか
zh_cn: 是否启用Pvn同步事件(如同步完成/同步失败)通知

# SettingsPage_Notification_Pvn_Empty.Title
source: Pvn Sync Empty Event Notification
ja_jp: Pvn同期空イベント通知
zh_cn: Pvn同步空事件通知

# SettingsPage_Notification_Pvn_Empty.Description
source: Enable notifications for Pvn Sync empty events (i.e., already up to date, nothing was done)
ja_jp: Pvn同期空イベント（つまり、既に最新の状態であり、何も行われていない）の通知を有効にしますか
zh_cn: 是否启用Pvn同步空事件（即已是最新状态，什么都没有做）的通知

# FaqService_LoadError
source: Failed to load FAQ file
ja_jp: FAQファイルのロードに失敗しました
zh_cn: 加载FAQ文件失败

# FaqService_DownloadError
source: Failed to download FAQ
ja_jp: FAQのダウンロードに失敗しました
zh_cn: 下载FAQ失败

# GalgamePage_Characters.Text
source: Character
ja_jp: キャラクター
zh_cn: 角色

# PvnSyncTask_Error_Delete
source: Failed to upload Pvn Sync deletion record (id:{0})
ja_jp: Pvn同期削除記録(id:{0})のアップロードに失敗しました
zh_cn: Pvn同步上传删除记录(id:{0})失败

# PvnSyncTask_Deleting
source: Uploading deletion record (id:{0})
ja_jp: 削除記録 (id:{0}) をアップロード中
zh_cn: 正在上传删除记录(id:{0})

# PvnSyncTask_Commit_Delete
source: Delete game id:{0}
ja_jp: ゲーム id: {0}を削除
zh_cn: 删除游戏 id:{0}

# GalgameCharacterPage_BirthDate.Text
source: Birthday
ja_jp: 誕生日
zh_cn: 生日

# GalgameCharacterPage_Relation.Text
source: Relationship
ja_jp: 関係
zh_cn: 关系

# GalgameCharacterPage_Gender.Text
source: Gender
ja_jp: 性別
zh_cn: 性别

# GalgameCharacterPage_Height.Text
source: Height
ja_jp: 身長
zh_cn: 身高

# GalgameCharacterPage_Weight.Text
source: Weight
ja_jp: 体重
zh_cn: 体重

# GalgameCharacterPage_BWH.Text
source: BWH
ja_jp: スリーサイズ
zh_cn: 三围

# GalgameCharacterPage_BloodType.Text
source: Blood type
ja_jp: 血液型
zh_cn: 血型

# Gender_Unknown
source: Unknown
ja_jp: 不明
zh_cn: 未知

# Gender_Male
source: Male
ja_jp: 男性
zh_cn: 男性

# Gender_Female
source: Female
ja_jp: 女性
zh_cn: 女性

# GalgameFolder_GetGalgameInfo_Saving
source: Finished getting game info from RSS, saving records.
ja_jp: RSSからゲーム情報の取得が完了しました。記録を保存しています。
zh_cn: 从RSS获取游戏信息完成，保存记录中

# GalgameFolder_GetGalgameInfo_Done
source: Saved
ja_jp: 保存完了
zh_cn: 保存完成

# GetGalgameInfoTask_Title
source: Download game metadata task
ja_jp: ゲームデータダウンロードタスク
zh_cn: 下载游戏数据任务

# Galgame_GetCharacterInfo_Saving
source: Finished getting character info from RSS, saving records.
ja_jp: RSSからキャラクター情報の取得が完了しました。記録を保存しています。
zh_cn: 从RSS获取角色信息完成，保存记录中

# Galgame_GetCharacterInfo_Done
source: Successfully downloaded {0}'s character information
ja_jp: {0}のキャラクター情報を正常にダウンロードしました
zh_cn: 已成功下载{0}的角色信息

# GetCharacterInfoTask_Title
source: Download character data task
ja_jp: キャラクターデータダウンロードタスク
zh_cn: 下载角色数据任务

# Galgame_GetCharacterInfo_GettingInfo
source: Getting info for {0}
ja_jp: {0} の情報を取得しています
zh_cn: 正在获取 {0} 的信息

# GalgameFolder_GetGalgameInfo_Waiting
source: Waiting for character info download to complete
ja_jp: キャラクター情報のダウンロード完了を待機中
zh_cn: 等待角色信息下载完成

# PvnService_UploadImageFailed
source: Upload game {0} cover failed
ja_jp: ゲーム{0}のカバーのアップロードに失敗しました
zh_cn: 上传游戏{0}封面失败

# AccountPage_Pvn_CloudStorage.Title
source: Pvn Cloud Storage
ja_jp: Pvnクラウドストレージ
zh_cn: Pvn云存储空间

# AccountPage_Pvn_CloudStorage.Description
source: These spaces are used to store game covers synced to the cloud.
ja_jp: これらのスペースは、クラウドに同期されたゲームのカバーを保存するために使用されます
zh_cn: 这些空间用来放同步到云端的游戏封面

# AccountPage_Pvn_SpaceUsedPercent
source: Used {0}%
ja_jp: 使用済み {0}%
zh_cn: 已使用 {0}%

# PvnService_DownloadAvatarFailed
source: Failed to download Pvn account avatar
ja_jp: Pvnアカウントアバターのダウンロードに失敗しました
zh_cn: 下载Pvn账户头像失败

# PvnService_UploadAvatarFailed
source: Failed to upload account avatar
ja_jp: アカウントアバターのアップロードに失敗しました
zh_cn: 上传账户头像失败

# App_Error
source: Oops, the last run crashed
ja_jp: おっと、前回の実行はクラッシュしました
zh_cn: Oops, 上次运行崩溃了

# AccountPage_Bgm_NoLogin
source: Not yet logged in to Bangumi account!
ja_jp: まだBangumiアカウントにログインしていません~
zh_cn: 还没登录Bangumi账号呢~

# AccountPage_Bgm_LoginedDescription
source: User ID: {0}, Authorized until: {1}, Next authorization refresh: {2}
ja_jp: ユーザーID:{0}、承認期限:{1}、次回の承認更新:{2}
zh_cn: 用户ID:{0}, 授权至:{1}, 下次刷新授权:{2}

# AccountPage_LogoutSuccess
source: Logout successful
ja_jp: ログアウトしました
zh_cn: 登出成功

# BgmOAuthService_FetchTokenInfoFailed
source: Failed to fetch Bangumi Token information
ja_jp: Bangumiトークン情報の取得に失敗しました
zh_cn: 获取Bangumi Token信息失败

# BgmOAuthService_FetchAvatarFailed
source: Failed to download Bangumi account avatar
ja_jp: Bangumiアカウントのアバターのダウンロードに失敗しました
zh_cn: 下载Bangumi账户头像失败

# BgmOAuthService_FetchAccountFailed
source: Failed to fetch Bangumi account information.
ja_jp: Bangumiアカウント情報の取得に失敗しました
zh_cn: 获取Bangumi账号信息失败

# BgmOAuthStatus_Failed
source: NOT USED
ja_jp: 使用されていません

# BgmOAuthStatus_Done
source: Bangumi account login successful.
ja_jp: Bangumiアカウントのログインに成功しました
zh_cn: Bangumi账户登录成功

# BgmOAuthService_FetchTokenFailed
source: Failed to fetch Bangumi Token.
ja_jp: Bangumiトークンの取得に失敗しました
zh_cn: 获取Bangumi Token失败

# BgmOAuthStatus_FetchingTokenInfo
source: Fetching Bangumi Token information.
ja_jp: Bangumiトークン情報を取得中
zh_cn: 获取Bangumi Token信息中

# BgmOAuthStatus_FetchingAccountImage
source: Fetching Bangumi avatar.
ja_jp: Bangumiアバターを取得中
zh_cn: 获取Bangumi头像中

# AccountPage_Bgm_RefreshToken.Title
source: Refresh Authorization.
ja_jp: 認証を更新
zh_cn: 刷新授权

# AccountPage_Bgm_RefreshToken.Description
source: Refresh authorization now and update account information.
ja_jp: すぐに認証を更新し、アカウント情報を更新します。
zh_cn: 立刻刷新授权，并更新账户信息。

# AccountPage_Bgm_Refreshing
source: Fetching new Token.
ja_jp: 新しいトークンを取得中
zh_cn: 正在获取新的Token

# AccountPage_Bgm_RefreshSuccess
source: Bangumi account authorization and information refresh successful.
ja_jp: Bangumiアカウントの認証と情報の更新に成功しました
zh_cn: Bangumi账号授权与信息刷新成功

# AccountPage_Vndb_NoLogin
source: Not yet logged in to Vndb account!
ja_jp: まだVndbアカウントにログインしていません〜
zh_cn: 还没登录Vndb账号呢~

# AccountPage_Vndb_LoginedDescription
source: User ID: {0}, Token Permissions: {1}
ja_jp: ユーザーID: {0}, トークン権限: {1}
zh_cn: 用户ID: {0}, Token权限: {1}

# VndbAuthService_InvalidToken
source: Vndb Token Error
ja_jp: Vndbトークンエラー
zh_cn: Vndb Token错误

# VndbAuthService_Success
source: Vndb login successful
ja_jp: Vndbログイン成功
zh_cn: Vndb登录成功

# VndbApiPermission_ListRead
source: List Read
ja_jp: ユーザーリスト読み取り
zh_cn: 用户列表读取

# VndbApiPermission_ListWrite
source: List Write
ja_jp: ユーザーリスト書き込み
zh_cn: 用户列表增改

# AccountPage_VndbTokenPermissions.Text
source: Token Permissions
ja_jp: トークン権限
zh_cn: Token权限

# AddSourceDialog.Title
source: Add Source
ja_jp: ソースを追加
zh_cn: 添加源

# GalgameSourceType_LocalFolder
source: Local Folder
ja_jp: ローカルフォルダ
zh_cn: 本地文件夹

# GalgameSourceType_LocalZip
source: Local Archive
ja_jp: ローカル圧縮ファイル
zh_cn: 本地压缩包

# LocalSettingService_ResetConfig
source: Unable to read software settings correctly, possibly software data is corrupted. Please refer to the link: https://github.com/GoldenPotato137/PotatoVN/wiki/TroubleShooting for solutions. Software data has been reset.
ja_jp: ソフトウェア設定を正しく読み取れませんでした。ソフトウェアデータが破損している可能性があります。解決策については、リンク：https://github.com/GoldenPotato137/PotatoVN/wiki/TroubleShooting を参照してください。ソフトウェアデータはリセットされました。
zh_cn: 无法正确读取软件设置，可能软件数据损坏了。请参考链接：https://github.com/GoldenPotato137/PotatoVN/wiki/TroubleShooting 查看解决方案。软件数据已重置。

# UnexpectedEvent
source: Unexpected Error
ja_jp: 予期せぬエラー
zh_cn: 非预计错误

# GalgameCollectionService_BackupMetaFailed
source: Failed to backup {0}'s metadata to source {1}.
ja_jp: {0}のメタデータをソースへバックアップ{1}できませんでした
zh_cn: 备份{0}的Meta到源{1}失败

# GalgamePage_MoveToAnotherSource.Label
source: Move to another source
ja_jp: 別のソースへ移動
zh_cn: 移入另一个源

# ChangeSourceDialog_TargetSource.Text
source: Move to
ja_jp: 移動
zh_cn: 移入

# ChangeSourceDialog_FetchingSourceInfo.Text
source: Fetching game source information
ja_jp: ゲームソース情報を取得中
zh_cn: 获取游戏源信息中

# LocalFolderSourceService_SelectFolder
source: Target Folder
ja_jp: 保存先フォルダー
zh_cn: 目标文件夹

# ChangeSourceDialog_Space
source: {0} available, total {1}
ja_jp: {0} 利用可能、合計 {1}
zh_cn: {0} 可用，共 {1}

# ChangeSourceDialog_RemoveFromSource.Content
source: And remove the game from the selected source
ja_jp: 選択したソースからゲームを移動
zh_cn: 并将游戏移出下选中源

# LocalFolderSourceService_MoveInDescription
source: Copy game to: {0}
ja_jp: ゲームをコピー: {0}
zh_cn: 复制游戏至：{0}

# LocalFolderSourceService_MoveOutDescription
source: Delete folder: {0}
ja_jp: フォルダーを削除: {0}
zh_cn: 删除文件夹：{0}

# ChangeSourceDialog_OperateDescription.Text
source: After clicking OK, PotatoVN will:
ja_jp: OKをクリックすると、PotatoVNは以下を実行します:
zh_cn: 点击确定后，PotatoVN将：

# SettingsPage_Theme_TimeAsHour.Title
source: Time unit displayed as "hours + minutes"
ja_jp: 時間単位を「時間+分」で表示する
zh_cn: 时间单位显示为"小时+分钟"

# SettingsPage_Theme_TimeAsHour.Description
source: Convert time display from "minutes" to "hours + minutes" format (e.g., 441 minutes → 7 hours 21 minutes)
ja_jp: 時間表示を「分」から「時間+分」形式に変換する（例：441分 → 7時間21分）
zh_cn: 将时间显示从"分钟"转换为"小时+分钟"格式（例如：441分钟 → 7小时21分钟）

# ManageGalgamePageLayoutDialog_NewLayout.Text
source: Use new interface for game details page
ja_jp: ゲーム詳細ページで新しいUIを使用
zh_cn: 游戏详情页使用新界面

# SettingsPage_Theme_ManageGalgamePageLayout.Title
source: Manage the layout of the new interface
ja_jp: 新しい画面の表示レイアウトを管理
zh_cn: 管理新界面显示的布局

# SettingsPage_Theme_ManageGalgamePageLayout.Description
source: You can choose whether to display various sections of the game details page.
ja_jp: ゲーム詳細ページの各セクションの表示/非表示を選択できます
zh_cn: 可以选择是否显示游戏详情页的各个部分

# BgTaskService_TaskFailed
source: {0} failed
ja_jp: {0}が失敗しました
zh_cn: {0}失败

# BgTaskService_TaskSuccess
source: {0} completed
ja_jp: {0}が完了しました
zh_cn: {0}完成

# RecordPlayTimeTask_Done
source: This session's play time for {0}: {1}
ja_jp: 今回の{0}のプレイ時間：{1}
zh_cn: 本次游玩 {0} 时长：{1}

# LocalFolderSourceMoveTask_MoveIn_Title
source: Copy Game Task
ja_jp: ゲームコピー処理
zh_cn: 复制游戏任务

# LocalFolderSourceMoveTask_MoveIn_Progress
source: Copying {0}
ja_jp: {0}をコピー中です
zh_cn: 正在复制 {0}

# SourceMoveInBase_Success
source: Successfully copied the game to another source
ja_jp: ゲームを別のソースへ正常にコピーしました
zh_cn: 成功将游戏复制至另一个源

# LocalFolderSourceMoveTask_MoveIn_Success
source: Successfully copied game {0} to {1}
ja_jp: ゲーム「{0}」を「{1}」に正常にコピーしました
zh_cn: 成功将游戏 {0} 复制到 {1}

# SourceMoveTask_Title
source: Move Game Source Task
ja_jp: ゲームのソース移動処理
zh_cn: 移动游戏所在源任务

# SourceMoveTask_MovingIn
source: Moving game to another source
ja_jp: ゲームを別のソースへ移動する処理を実行中です
zh_cn: 正在执行游戏搬入另一个源的任务

# LocalFolderSourceService_MoveOutError
source: A game can only belong to one local folder. To move it to another local folder, it must be moved out of the current local folder first.
ja_jp: 1つのゲームは1つのローカルフォルダにのみ属することができます。他のローカルフォルダに移動するには、現在のローカルフォルダから移動する必要があります。
zh_cn: 一个游戏只能属于一个本地文件夹，要移入其他本地文件夹必须从当前本地文件夹中移出。

# SourceMoveTask_MovingIn_Fail
source: Move in source task failed
ja_jp: ソースの移動タスクが失敗しました
zh_cn: 移入源任务失败

# SourceMoveTask_MovingOut
source: Moving game out of specified source
ja_jp: 指定されたソースからゲームを移動するタスクを実行中です
zh_cn: 正在执行游戏搬出指定源的任务

# SourceMoveTask_MovingOut_Fail
source: Remove source task failed
ja_jp: ソースの削除タスクが失敗しました
zh_cn: 移除源任务失败

# SourceMoveTask_Success_MoveIn
source: Successfully moved {0} into {1}
ja_jp: {0} を {1} に正常に移動しました
zh_cn: 已成功将 {0} 移入 {1}

# SourceMoveTask_Success_MoveOut
source: Successfully moved {0} out of {1}
ja_jp: {0} を {1} から正常に移動しました
zh_cn: 已成功将 {0} 移出 {1}

# LocalFolderSourceMoveTask_MoveOut_Title
source: Delete Game from Folder
ja_jp: フォルダーからゲームを削除するタスク
zh_cn: 从文件夹中删除游戏任务

# LocalFolderSourceMoveTask_MoveOut_Progress
source: Deleting {0}
ja_jp: {0} を削除しています
zh_cn: 正在删除 {0}

# LocalFolderSourceMoveTask_MoveOut_Success
source: Successfully deleted folder {0}
ja_jp: フォルダー {0} を正常に削除しました
zh_cn: 成功删除文件夹 {0}

# MixedPhraserOrderDialog_Title
source: Set Feeds Priority
ja_jp: 情報源の優先順位を設定
zh_cn: 设置信息源优先级

# MixedPhraserOrderDialog_Description.Text
source: Drag to set priority
ja_jp: ドラッグして優先順位を設定
zh_cn: 拖动设置优先级

# MixedPhraserOrderDialog_It_Name
source: Name of the game
ja_jp: ゲーム名
zh_cn: 游戏名

# MixedPhraserOrderDialog_It_Des
source: Description
ja_jp: 概要
zh_cn: 简介

# SettingsPage_Rss_Mixed_Order.Title
source: Information Mixing Method
ja_jp: 情報混合方法
zh_cn: 信息混合方法

# SettingsPage_Rss_Mixed_Order.Description
source: Configure the priority of each source when the mixed scraper combines data scraped from different data sources.
ja_jp: 混合スクレイパーが異なるデータソースから取得したデータを混合する際の各ソースの優先順位を設定します。
zh_cn: 设置混合搜刮器从不同数据源混合搜刮下来的数据时各个源的优先级

# MixedPhraserOrderDialog_It_Exp
source: Estimated Playtime
ja_jp: 推定プレイ時間
zh_cn: 预计游玩时长

# MixedPhraserOrderDialog_It_Rating
source: Rating
ja_jp: 評価
zh_cn: 评分

# MixedPhraserOrderDialog_It_Image
source: Cover Image
ja_jp: カバー画像
zh_cn: 封面图

# MixedPhraserOrderDialog_It_ReleaseDate
source: Release Date
ja_jp: 発売日
zh_cn: 发布日期

# MixedPhraserOrderDialog_It_Character
source: Character
ja_jp: キャラクター
zh_cn: 角色

# MixedPhraserOrderDialog_It_CnName
source: Chinese Name
ja_jp: 中国語名
zh_cn: 中文名

# MixedPhraserOrderDialog_It_Dev
source: Developer
ja_jp: 制作会社
zh_cn: 制作公司

# MixedPhraserOrderDialog_It_Tag
source: Tag
ja_jp: タグ

# MixedPhraserOrderDialog_It_Staff
source: Staff
ja_jp: スタッフ
zh_cn: 制作人员

# BgmAuthDialog_Title
source: Select Login Method
ja_jp: ログイン方法を選択
zh_cn: 选择登录方式

# VndbAuthDialog_Title
source: Vndb Login
ja_jp: VNDBログイン
zh_cn: Vndb登录

# VndbAuthDialog_TokenTextBox.Header
source: Enter Access Token
ja_jp: アクセストークンを入力
zh_cn: 输入AccessToken

# GalgameSettingPage_TagsTitle.Text
source: Tags
ja_jp: タグ

# WindowMode_None
source: Do nothing
ja_jp: 何もしない
zh_cn: 什么都不做

# GalgameSettingPage_LastFetchInfoTime
source: Last data fetch: {0}
ja_jp: 最終データ取得：{0}
zh_cn: 上次拉取数据：{0}

# HomePage_NoDeveloperCategory
source: No developer category contains this game
ja_jp: このゲームを含む制作会社カテゴリはありません
zh_cn: 无任何制作公司分类包含本游戏

# LibraryPage_EditFolder.Text
source: Manage Library
ja_jp: ライブラリを管理
zh_cn: 管理游戏库

# LibraryPage_Back.Label
source: Back to previous library
ja_jp: 前のライブラリに戻る
zh_cn: 回到上个库

# LibraryPage_DownloadAllData.Label
source: Download game data for the current library
ja_jp: 現在のライブラリのゲームデータをダウンロード
zh_cn: 下载当前库的游戏数据

# LibraryPage_EditCurrentFolder.Text
source: Manage Current Library
ja_jp: 現在のライブラリを管理
zh_cn: 管理当前库

# LibraryPage_EditCurrentFolder_AppBarButton.Label
source: Edit Current Folder
ja_jp: 現在のライブラリを管理
zh_cn: 管理当前库

# LibraryPage_EditGameInfo.Text
source: Edit Game Info
ja_jp: ゲーム情報を変更
zh_cn: 修改游戏信息

# LibraryPage_DownloadGameInfo.Text
source: Download Game Info
ja_jp: ゲーム情報をダウンロード
zh_cn: 下载游戏信息

# LibraryPage_RemoveGame.Text
source: Remove Game from Library
ja_jp: ライブラリからゲームを削除
zh_cn: 从库中移除游戏

# LibraryPage_Statistics
source: Library: {0} | Games: {1}
ja_jp: ゲームライブラリ: {0} | ゲーム: {1}
zh_cn: 游戏库: {0} | 游戏: {1}

# GalgameCollectionService_LoadMetaFailed
source: Failed to load local Meta
ja_jp: ローカルメタデータの読み込みに失敗しました
zh_cn: 加载本地Meta失败

# GalgameCollectionService_LoadMetaFailed_Msg
source: Failed to load local Meta for {0}, its Meta file has been ignored
ja_jp: {0}のローカルMetaの読み込みに失敗しました。Metaファイルは無視されました。
zh_cn: 加载{0}的本地Meta失败了，已忽略其Meta文件

# GalgameCollectionService_GetNameFromPathFailed
source: Unable to get game name from path
ja_jp: パスからゲーム名を取得できません。
zh_cn: 无法从路径获取游戏名

# GalgameSourceCollectionService_InitAsync_GalgameIsNull
source: Library management: The Galgame for {0} is null. This game has been removed from source: {1}.
ja_jp: ゲームライブラリ管理：{0}のギャルゲーがnullです。このゲームはソース：{1}から移動されました。
zh_cn: 游戏库管理：{0}的Galgame为null，已将该游戏移出源：{1}

# GalgameSourceCollectionService_CheckGamesInSourceFailed
source: An error occurred while checking for games in library {0}
ja_jp: ライブラリ {0} 内のゲームの存在を確認中にエラーが発生しました。
zh_cn: 检测库 {0} 中游戏是否存在时遇到错误

# GalgameSourceCollectionService_CheckGamesInSource_Title
source: Some games have been removed from library : {0}
ja_jp: 一部のゲームがライブラリ {0} から移動されました。
zh_cn: 已将部分游戏移出库 {0}

# GalgameSourceCollectionService_CheckGamesInSource_Msg
source: The following games have been removed from this library because they could not be detected within it: {0}
ja_jp: このライブラリで以下のゲームが検出できなかったため、このライブラリから移動されました：{0}
zh_cn: 由于无法在该库中检测到下列游戏，已将下列游戏移出了该库：{0}

# GalgameSettingPage_GameSetting_Parameter.Text
source: Game Launch Parameters
ja_jp: ゲーム起動パラメーター
zh_cn: 游戏启动参数

# GalgameSettingPage_GameSetting_ExePath.Title
source: Game Executable File
ja_jp: ゲーム起動ファイル
zh_cn: 游戏启动文件

# GalgameSettingPage_EditPath.Text
source: Edit game path
ja_jp: ゲームパスの変更
zh_cn: 修改游戏路径

# GalgameSettingPage_EditExePath.Text
source: Edit game executable file
ja_jp: ゲーム起動ファイルの変更
zh_cn: 修改游戏启动文件

# GalgameSettingPage_Search.Text
source: Search games online
ja_jp: オンラインゲームを検索
zh_cn: 在线搜索游戏

# GalgameSettingPage_GameInfo_ReleaseDate.Text
source: Release Date
ja_jp: 発売日
zh_cn: 发行日期

# GalgameSettingPage_NotLocalGame
source: This game is not a local game, please set the game folder path.
ja_jp: このゲームはローカルゲームではありません。ゲームフォルダのパスを設定してください。
zh_cn: 本游戏不是本地游戏，请设置该游戏文件夹路径~

# GalgameSettingPage_ExePathSetSuccess
source: Game launch file set successfully
ja_jp: ゲーム起動ファイルの設定に成功しました
zh_cn: 成功设置游戏启动文件

# GalgameSettingPage_ExePathSetCanceled
source: User cancelled the operation
ja_jp: ユーザーが操作をキャンセルしました
zh_cn: 用户取消了操作

# GalgameSettingPage_ExePathSetFailed
source: Failed to set game launch file
ja_jp: ゲーム起動ファイルの設定に失敗しました
zh_cn: 设置游戏启动文件失败

# GalgameSettingPage_PathSetSuccess
source: Game path changed successfully
ja_jp: ゲームパスの変更に成功しました
zh_cn: 修改游戏路径成功

# GalgameSettingPage_PathSetFailed
source: Failed to change game path
ja_jp: ゲームパスの変更に失敗しました
zh_cn: 修改游戏路径失败

# GalgameSourcePage_NotInSource
source: This game does not belong to this library (the game must be inside the library folder)
ja_jp: このゲームはこのライブラリに属していません（ゲームはライブラリフォルダ内にある必要があります）。
zh_cn: 该游戏不属于这个库（游戏必须在库文件夹里面）

# GalgameFolder_UnpackGame_PathNotExist
source: Path {0} does not exist
ja_jp: パス {0} は存在しません。
zh_cn: 路径 {0} 不存在

# GalgameFolder_UnpackGame_PathNotEmpty
source: {0} is not empty. Please delete this folder before unpacking.
ja_jp: {0} は空ではありません。解凍する前にこのフォルダーを削除してください。
zh_cn: {0} 非空，请先删除该文件夹后再解压

# PackGameTask_Title
source: Pack Game Task
ja_jp: ゲーム圧縮タスク
zh_cn: 压缩游戏任务

# PackGameTask_ZipExist
source: {0} already exists. Please delete this file before packing.
ja_jp: {0} は既に存在します。圧縮する前にこのファイルを削除してください。
zh_cn: {0} 已存在，请删除该文件后再压缩

# PackGameTask_GamePathNotExist
source: Folder {0} does not exist
ja_jp: フォルダー {0}は存在しません。
zh_cn: 文件夹 {0} 不存在

# ConfirmGalInfoDialog_GalgameName.Text
source: Game Name
ja_jp: ゲーム名
zh_cn: 游戏名称

# ConfirmGalInfoDialog_GalgameRssType.Text
source: Feeds
ja_jp: 情報源
zh_cn: 信息源

# ConfirmGalInfoDialog_GalgameId.Text
source: Game ID
ja_jp: ゲームID
zh_cn: 游戏ID

# ConfirmGalInfoDialog_Title_Correct
source: Is the retrieved information correct?
ja_jp: 取得した情報は正しいですか？
zh_cn: 搜刮到的信息正确吗？

# ConfirmGalInfoDialog_Title_NotFound
source: Game information not found
ja_jp: このゲーム情報は見つかりませんでした。
zh_cn: 没有找到该游戏信息

source: Canceled
ja_jp: ユーザーが操作をキャンセルしました。
zh_cn: 用户取消了操作

# ConfirmGalInfoDialog_NoID
source: No game data found. Please try modifying the game ID or game name and search again.
ja_jp: 現在ゲームデータが見つかりません。ゲームIDまたはゲーム名を変更して再検索してください。
zh_cn: 目前没有找到游戏数据，请尝试修改游戏ID或游戏名重新搜索。

# ConfirmGalInfoDialog_ID
source: Currently found game data sources: {0}
ja_jp: 現在見つかったゲームデータソース：{0}
zh_cn: 目前找到的游戏数据源有：{0}

# ConfirmGalInfoDialog_Hint
source: If the game ID is modified, search by game ID first; otherwise, search by game name and current information source.
ja_jp: ゲームIDを変更した場合、ゲームIDを優先して検索します。それ以外の場合は、ゲーム名と現在の情報源を使用して検索します。
zh_cn: 若修改了游戏ID，优先使用游戏ID进行搜索，否则使用游戏名称与当前信息源进行搜索。
